package ru.university.taskcalendar.data
object TestData {

    val tasks: MutableList<Task> = mutableListOf(
        Task(
            id = 1L,
            title = "Сходить в продуктовый магазин",
            description = "молоко (2 л), яйца (1 десяток), хлеб цельнозерновой (1 буханка), бананы (1 кг), куриная грудка (500 г), огурцы (3 шт.), гречка (1 упаковка).",
            date = "28.09.2026",
            isDone = false
        ),
        Task(
            id = 2L,
            title = "Забрать заказ из пункта выдачи",
            description = "заказ №123456, кроссовки и футболка; проверить целостность упаковки и размер при получении.",
            date = "30.09.2026",
            isDone = false
        ),
        Task(
            id = 3L,
            title = "Записаться к стоматологу и подтвердить визит",
            description = " зайти в приложение клиники, выбрать свободное окно на следующую неделю, записать дату и время в календарь, поставить напоминание за день.",
            date = "02.10.2026",
            isDone = true
        ),
        Task(
            id = 4L,
            title = "Купить канцелярию для работы",
            description = "блокнот на 96 листов, набор ручек (синяя, чёрная, красная), маркеры-текстовыделители (4 цвета), папка-скоросшиватель, стикеры.",
            date = "05.10.2026",
            isDone = false
        ),
        Task(
            id = 5L,
            title = "Подготовить продукты для ужина",
            description = "филе лосося (400 г), брокколи (300 г), лимон (1 шт.), оливковое масло, специи. Дома: промыть и обсушить рыбу, нарезать овощи, разложить по контейнерам, чтобы вечером быстро запечь.",
            date = "07.10.2026",
            isDone = false
        )
    )
}
